app/views/quests/_form.html.erb

    <%= f.label :discipline_id %><br>
      <%= f.collection_select(:discipline_id, Discipline.all, :id, :name, include_blank: true) %>
---
SELECT "disciplines".* FROM "disciplines"

    # teste de um if para poder realizar filtro especifico
     f.collection_select(:subject_id, Subject.all, :id, :name, include_blank: true)
---
SELECT "subjects".* FROM "subjects"