app/views/issues/_form.html.erb

    <div class="controls">
      <%= f.grouped_collection_select( :subject_id, current_user.teacher.disciplines, :subjects, :name, :id , :name, include_blank: true) %>
---
SELECT  "teachers".* FROM "teachers"  WHERE "teachers"."user_id" = ? LIMIT 1  [["user_id", 2]]
SELECT "disciplines".* FROM "disciplines"  WHERE "disciplines"."teacher_id" = ?  [["teacher_id", 2]]
SELECT "subjects".* FROM "subjects"  WHERE "subjects"."discipline_id" = ?  [["discipline_id", 1]]