app/views/issues/show.html.erb

SELECT "alternatives".* FROM "alternatives"  WHERE "alternatives"."issue_id" = ?  [["issue_id", 17]]
---

<% @issue.alternatives.each do |alternativa| %>