app/controllers/alternatives_controller.rb

  def index
    @alternatives = Alternative.all
---
SELECT "alternatives".* FROM "alternatives"

  def create
     @issue = Issue.find(params[:issue_id])
    @alternative = @issue.alternatives.create(params[:alternative])
---
SELECT  "issues".* FROM "issues"  WHERE "issues"."id" = ? LIMIT 1  [["id", 17]]
INSERT INTO "alternatives" ("correct", "created_at", "description", "issue_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["correct", "t"], ["created_at", "2015-01-29 11:34:05.887220"], ["description", "teste"], ["issue_id", 17], ["updated_at", "2015-01-29 11:34:05.887220"]]

  def destroy


    @issue = Issue.find(params[:issue_id])
    @alternative = @issue.alternatives.find(params[:id])
    @alternative.destroy
---
SELECT  "issues".* FROM "issues"  WHERE "issues"."id" = ? LIMIT 1  [["id", 17]]
SELECT  "alternatives".* FROM "alternatives"  WHERE "alternatives"."issue_id" = ? AND "alternatives"."id" = ? LIMIT 1  [["issue_id", 17], ["id", 5]]
DELETE FROM "alternatives" WHERE "alternatives"."id" = ?  [["id", 3]]

    def set_alternative
      @alternative = Alternative.find(params[:id])
---
SELECT  "alternatives".* FROM "alternatives"  WHERE "alternatives"."id" = ? LIMIT 1  [["id", 1]]