app/controllers/disciplines_controller.rb

  def index

    @disciplines  = Discipline.all
---
SELECT "disciplines".* FROM "disciplines"  WHERE (teacher_id => teacher_id)

  def create
    @discipline = Discipline.new(discipline_params)

    respond_to do |format|
      if @discipline.save
---
INSERT INTO "disciplines" ("created_at", "name", "teacher_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-27 18:29:54.838912"], ["name", "Geografia"], ["teacher_id", 1], ["updated_at", "2015-01-27 18:29:54.838912"]]

  def destroy
    @discipline.destroy
---
DELETE FROM "disciplines" WHERE "disciplines"."id" = ?  [["id", 7]]

    def set_discipline
      @discipline = Discipline.find(params[:id])
---
SELECT  "disciplines".* FROM "disciplines"  WHERE "disciplines"."id" = ? LIMIT 1  [["id", 7]]