app/controllers/disciplinas_controller.rb

  def index
    @disciplinas = Disciplina.all
---
SELECT "disciplinas".* FROM "disciplinas"

  def create
    @disciplina = Disciplina.new(disciplina_params)

    respond_to do |format|
      if @disciplina.save
---
INSERT INTO "disciplinas" ("created_at", "nome", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-01-15 16:45:48.966633"], ["nome", "asdf"], ["updated_at", "2015-01-15 16:45:48.966633"]]

    def set_disciplina
      @disciplina = Disciplina.find(params[:id])
---
SELECT  "disciplinas".* FROM "disciplinas"  WHERE "disciplinas"."id" = ? LIMIT 1  [["id", 1]]