app/controllers/issues_controller.rb

SELECT "issues".* FROM "issues"
---
  def index
    @issues = Issue.all

INSERT INTO "issues" ("created_at", "dificulty", "inunciation", "subject_id", "tipo", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-01-28 18:16:55.107913"], ["dificulty", "F"], ["inunciation", "Quantos possue o sistema Solar?"], ["subject_id", 2], ["tipo", "M"], ["updated_at", "2015-01-28 18:16:55.107913"]]
---
  def create
    @issue = Issue.new(issue_params)

    respond_to do |format|
      if @issue.save

DELETE FROM "issues" WHERE "issues"."id" = ?  [["id", 1]]
---
  def destroy
    @issue.destroy