app/controllers/profs_controller.rb

  def index
    @profs = Prof.all
---
SELECT "profs".* FROM "profs"

  def create
    @prof = Prof.new(prof_params)

    respond_to do |format|
      if @prof.save
---
INSERT INTO "profs" ("created_at", "email", "login", "nome", "senha", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-01-24 16:30:51.406760"], ["email", "asdfasdf"], ["login", "asdfasdf"], ["nome", "asdfsa"], ["senha", "asdfsdaf"], ["updated_at", "2015-01-24 16:30:51.406760"]]

  def destroy
    @prof.destroy
---
DELETE FROM "profs" WHERE "profs"."id" = ?  [["id", 2]]

    def set_prof
      @prof = Prof.find(params[:id])
---
SELECT  "profs".* FROM "profs"  WHERE "profs"."id" = ? LIMIT 1  [["id", 2]]