app/controllers/proofs_controller.rb

  def index
    @proofs = Proof.all
---
SELECT "proofs".* FROM "proofs"

  def create
    @proof = Proof.new(proof_params)

    respond_to do |format|

      if @proof.save
---
INSERT INTO "proofs" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-01-29 23:41:51.424592"], ["updated_at", "2015-01-29 23:41:51.424592"]]