app/controllers/proof_issues_controller.rb

SELECT "proof_issues".* FROM "proof_issues"
---
  def index

    @proof_issues = ProofIssue.all