app/controllers/quests_controller.rb

SELECT "quests".* FROM "quests"
---
  def index
    @quests = Quest.all

INSERT INTO "quests" ("a", "assunto_id", "b", "c", "correta", "created_at", "d", "disc_id", "nivel", "pergunta", "tipo", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @quest = Quest.new(quest_params)

    respond_to do |format|
      if @quest.save

SELECT  "quests".* FROM "quests"  WHERE "quests"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_quest
      @quest = Quest.find(params[:id])