app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'am3@cin.ufpe.br' LIMIT 1
SELECT  1 AS one FROM "teachers"  WHERE "teachers"."user_id" IN (1) LIMIT 1
---
def create
  user = User.authenticate(params[:email], params[:password])
  if user
    session[:user_id] = user.id
    user_id = user.id
    sql = "SELECT id
         FROM teachers
       WHERE user_id = user_id"

    Teacher.find_by_sql(sql).each do |row|
       session[:teacher_id] = "#{row.id},"

    end

    if Teacher.exists?(user_id: [user.id])