app/controllers/subjects_controller.rb

INSERT INTO "subjects" ("created_at", "discipline_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-28 15:34:03.112573"], ["discipline_id", 1], ["name", "Planetas"], ["updated_at", "2015-01-28 15:34:03.112573"]]
---
  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save

DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 1]]
---
  def destroy
    @subject.destroy