app/controllers/teachers_controller.rb

INSERT INTO "teachers" ("cpf", "created_at", "date", "name", "phone", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save